IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0l122x_l222x/GPIOA_1.0.xml
    </group>
    <group id="GPIOA_GEN_EVENT0" name="GPIOA_GEN_EVENT0" instances="1" offset="0x1050" instaddr="0x30" description="">
        <register id="GPIOA_GEN_EVENT0_IIDX" width="32" offset="0x0" description="Interrupt index">
            <bitfield id="STAT" description="Interrupt index status" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No bit is set means there is no pending interrupt request"/>
                <bitenum id="DIO0" value="0x1" description="DIO0 interrupt"/>
                <bitenum id="DIO1" value="0x2" description="DIO1 interrupt"/>
                <bitenum id="DIO2" value="0x3" description="DIO2 interrupt"/>
                <bitenum id="DIO3" value="0x4" description="DIO3 interrupt"/>
                <bitenum id="DIO4" value="0x5" description="DIO4 interrupt"/>
                <bitenum id="DIO5" value="0x6" description="DIO5 interrupt"/>
                <bitenum id="DIO6" value="0x7" description="DIO6 interrupt"/>
                <bitenum id="DIO7" value="0x8" description="DIO7 interrupt"/>
                <bitenum id="DIO8" value="0x9" description="DIO8 interrupt"/>
                <bitenum id="DIO9" value="0xA" description="DIO9 interrupt"/>
                <bitenum id="DIO10" value="0xB" description="DIO10 interrupt"/>
                <bitenum id="DIO11" value="0xC" description="DIO11 interrupt"/>
                <bitenum id="DIO12" value="0xD" description="DIO12 interrupt"/>
                <bitenum id="DIO13" value="0xE" description="DIO13 interrupt"/>
                <bitenum id="DIO14" value="0xF" description="DIO14 interrupt"/>
                <bitenum id="DIO15" value="0x10" description="DIO15 interrupt"/>
            </bitfield>
        </register>
        <register id="GPIOA_GEN_EVENT0_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="DIO0" description="DIO0 event mask" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO1" description="DIO1 event mask" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO2" description="DIO2 event mask" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO3" description="DIO3 event mask" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO4" description="DIO4 event mask" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO5" description="DIO5 event mask" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO6" description="DIO6 event mask" begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO7" description="DIO7 event mask" begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO8" description="DIO8 event mask" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO9" description="DIO9 event mask" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO10" description="DIO10 event mask" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO11" description="DIO11 event mask" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO12" description="DIO12 event mask" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO13" description="DIO13 event mask" begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO14" description="DIO14 event mask" begin="14" end="14" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO15" description="DIO15 event mask" begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
        </register>
